<?php
defined('BASEPATH') OR exit('No direct script access allowed');

/*
| -------------------------------------------------------------------------
| Memcached settings
| -------------------------------------------------------------------------
| Your Memcached servers can be specified below.
|
|       See: http://codeigniter.com/user_guide/libraries/caching.html#memcached
|
*/
$config['errcode'] = array(

	'-1' => '没有数据',
    '-2' => '请登录',
    '1002' => '请输入账号',//参数不能为空
    '2001' => '请选择要修改的数据',    
    '2002' => '该信息不存在',
    '2004' => '修改失败',
    '2010' => '添加失败',
    '2011' => '参数不能为空',
    '2012' => '删除失败',
    '3003' => '排序必须是大于0的正整数',
    '-3' => '上传失败',    

    '1001' => '账号密码不匹配',   
    '1004' => '登录过期,请重新登录',    
    '1000' => '您还没登录',
    '1003' => '请输入密码',
    '1005' => '该用户已被冻结',

    '2000' => '你没有权限修改',
    '2003' => '用户名不能为空',
    '2005' => '两次密码不一致',
    '2006' => '请输入账号名',
    '2007' => '请输入密码',
    '2008' => '请输入昵称',
    '2009' => '该管理员已存在',
    '2013' => '不能删除超级管理员',

    '3000' => '请输入标题',
    '3001' => '请输入内容',
    '3002' => '请上传图片或视频',
    '3004' => '请输入排序值',
    '3005' => '请确认是否置顶',

    '4000' => '请选择上传类型',

    '5000' => '请输入商品名称',
    '5001' => '请上传商品封面图',
    '5002' => '请上传商品详细图片',
    '5003' => '请填写商品价格',
    '5004' => '请填写商品介绍',
    '5005' => '请填写商品发货物流公司',
    '5006' => '请填写商品售后信息',
    '5007' => '请填写商品保养规则',
    '5008' => '请选择商品状态',
    '5009' => '请选择商品一级分类',
    '5010' => '请选择商品二级分类',
    '5011' => '请选择商品三级分类',
    '5012' => '请填写分类名称',
    '5013' => '请添加一张图片',
    '5014' => '该分类下边有产品，您不能删除',

    '6000' => '请上传封面',


    






);
